1m3_27mm_wall_H2_test_15/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "rho.*"
    {
        solver          diagonal;
    }

    p_rgh
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-6; //1e-8;
        relTol           0.01;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol           0;
    }

    "(U|h|k|epsilon|omega)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6; //1e-8;
        relTol          0.01;
    }

    "(U|h|k|epsilon|omega)Final"
    {
        $U;
        relTol          0;
    }

    ph_rgh
    {
        $p_rgh;
    }

    Yi
    {
        $hFinal;
    }

    Phi
    {
        $p_rgh;
    }
}

PIMPLE
{
    momentumPredictor off;
    nOuterCorrectors 1;
    nCorrectors     2;
    nNonOrthogonalCorrectors 1; 
    hydrostaticInitialisation true;
    nHydrostaticCorrectors    5;     // Optional: Number of iterations to reach equilibrium    
}

potentialFlow
{
    nNonOrthogonalCorrectors 10;
}

relaxationFactors
{
    equations
    {
        "(p|p_rgh|ph_rgh).*"                          0.5; //0.3;
        "(U|k|epsilon).*"                      0.7;
        "(H2|O2|H2O|air|h).*"                  0.7;
    }
}
// ************************************************************************* //
